#### StairsEditScope Members

---

|  |
| --- |
| StairsEditScope Class   Constructors   Methods   Properties   See Also |

The  StairsEditScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StairsEditScope | Instantiates a StairsEditScope object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | Cancels the edit scope. (Inherited from  EditScope  .) |
| Public method | Commit | Finishes the edit scope. (Inherited from  EditScope  .) |
| Public method | Dispose | (Inherited from  EditScope  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Start(ElementId) | Starts an stairs edit mode for an existing Stairs element |
| Public method | Start(ElementId, ElementId) | Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. (Inherited from  EditScope  .) |
| Public property | IsPermitted | Tells if the edit scope is permitted to start. (Inherited from  EditScope  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  EditScope  .) |

# See Also

StairsEditScope Class

Autodesk.Revit.DB Namespace